#include"header.h"
#include<math.h>
	

int main()
{ 
	int T; /*책의 개수*/  
	int n;
	 /*페이지로 받을수*/  
	int arr[10]={0};
	 /*각 숫자의 개수를 더할 배열 0으로 초기화합니다.*/ 
	int i,h,x,w;
	
	printf("책의 페이지 수? :" );
	scanf("%d", &n); /* 책의 페이지 수를 받는다.*/ 
	
 	int ace=n; 
	for(ace,w=1;ace;w += 10) /*자리수 하나당 일의 자리숫자의 갯수를 더할 것이므로 지수의 역할을 하는 w는 10을 곱한다. */
	{
	 /*지수로 사용할 숫자 1을준다.*/
	x = ace%10; /*1의자리 숫자중 0을 제외한 나머지 숫자 더한다.*/ 
	int next = ace / 10;/*현재 자리수보다 한자리 위의 숫자둘의 수 즉 몫을 구한다. */
	arr[0] += next * w; /*몫에 현재 자리수를 곱하면 0사용된 자리수의 합*/ 
	for(i=1;i<x+1;i++)
	{
		arr[i]+= (next +1)*w;/*나머지에 해당하는 숫자들을 하나씩 더함*/
		arr[x] -= w -(n%w) -1;/*나머지에 해당하는 부분에서 숫자가 큰건 존재하지 않는 숫자니까 뺴준다.  */
	}
	/*1의 자리수의 0~9 더하기*/
	for(i=x+1;i<10;i++) /*지정된 값의 최대값이 10억이니까 자리수의 최대는 10임  */
		arr[i] += next * w;
	ace = next; 
	}

	
	for (h =0; h<10; h++)
	{
	printf("%d ", arr[h]);
	}
	return 0;
}






